package com.prisonproject.main.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum EventTypeEnum {
    INMATE_ASSAULT(1, "Акт насильства, під час якого один або кілька ув'язнених фізично атакують іншого ув'язненого або працівника тюрми. Це може призвести до серйозних травм або навіть смерті."),
    ESCAPE_ATTEMPT(2, "Інцидент, коли один або кілька ув'язнених намагаються втекти з тюрми. Це може включати підкопи, використання підроблених ключів або інших методів для втечі."),
    CONTRABAND_SMUGGLING(3, "Проникнення заборонених предметів у тюрму, таких як наркотики, зброя, мобільні телефони або інші заборонені речі. Це може бути здійснено ув'язненими або їх відвідувачами."),
    MEDICAL_EMERGENCY(4, "Ситуація, коли ув'язнений потребує негайної медичної допомоги через хворобу, травму або інші медичні проблеми. Це може включати серцевий напад, важке поранення або передозування."),
    WEAPON_DISCOVERY(5, "Виявлення вогнепальної або холодної зброї у ув'язнених або в їхніх камерах. Це може становити серйозну загрозу для безпеки тюрми та потребує негайної реакції охорони.");
    private final Integer eventType;
    private final String description;
}
